{"weightsManifest": [{"paths": ["group1-shard1of13.bin", "group1-shard2of13.bin", "group1-shard3of13.bin", "group1-shard4of13.bin", "group1-shard5of13.bin", "group1-shard6of13.bin", "group1-shard7of13.bin", "group1-shard8of13.bin", "group1-shard9of13.bin", "group1-shard10of13.bin", "group1-shard11of13.bin", "group1-shard12of13.bin", "group1-shard13of13.bin"], "weights": [{"dtype": "int32", "name": "map_2/Const", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/map/TensorArrayUnstack_1/strided_slice/stack", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/map/TensorArrayUnstack_1/strided_slice/stack_1", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/map/TensorArrayUnstack_1/range/delta", "shape": []}, {"dtype": "int32", "name": "strided_slice_15/stack_1", "shape": [1]}, {"dtype": "int32", "name": "strided_slice_14/stack_1", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/strided_slice_4/stack", "shape": [3]}, {"dtype": "int32", "name": "SecondStagePostprocessor/strided_slice_4/stack_1", "shape": [3]}, {"dtype": "int32", "name": "SecondStagePostprocessor/strided_slice_4/stack_2", "shape": [3]}, {"dtype": "int32", "name": "SecondStagePostprocessor/ArgMax/dimension", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/ExpandDims_2/dim", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchGather/Reshape_2/shape", "shape": [1]}, {"dtype": "float32", "name": "Preprocessor/mul/x", "shape": []}, {"dtype": "float32", "name": "Preprocessor/sub/y", "shape": []}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/Conv2d_1a_7x7/depthwise_weights", "shape": [7, 7, 3, 8]}, {"dtype": "float32", "name": "Conv/weights", "shape": [3, 3, 576, 512]}, {"dtype": "float32", "name": "Conv/biases", "shape": [512]}, {"dtype": "float32", "name": "FirstStageBoxPredictor/ClassPredictor/weights", "shape": [1, 1, 512, 24]}, {"dtype": "float32", "name": "FirstStageBoxPredictor/ClassPredictor/biases", "shape": [24]}, {"dtype": "int32", "name": "strided_slice_10/stack_1", "shape": [3]}, {"dtype": "float32", "name": "FirstStageBoxPredictor/BoxEncodingPredictor/weights", "shape": [1, 1, 512, 48]}, {"dtype": "float32", "name": "FirstStageBoxPredictor/BoxEncodingPredictor/biases", "shape": [48]}, {"dtype": "int32", "name": "FirstStageBoxPredictor/Reshape/shape/3", "shape": []}, {"dtype": "int32", "name": "Reshape_1/shape", "shape": [2]}, {"dtype": "int32", "name": "Decode/transpose/perm", "shape": [2]}, {"dtype": "float32", "name": "GridAnchorGenerator/strided_slice_2", "shape": []}, {"dtype": "float32", "name": "GridAnchorGenerator/strided_slice_3", "shape": []}, {"dtype": "int32", "name": "GridAnchorGenerator/Meshgrid_3/ExpandedShape/concat", "shape": [3]}, {"dtype": "int32", "name": "GridAnchorGenerator/Reshape_2/shape", "shape": [2]}, {"dtype": "float32", "name": "GridAnchorGenerator/mul_5/x", "shape": []}, {"dtype": "float32", "name": "GridAnchorGenerator/Meshgrid_3/Reshape", "shape": [1, 1, 12]}, {"dtype": "float32", "name": "GridAnchorGenerator/Meshgrid_2/Reshape", "shape": [1, 1, 12]}, {"dtype": "int32", "name": "strided_slice_11/stack", "shape": [2]}, {"dtype": "int32", "name": "strided_slice_11/stack_1", "shape": [2]}, {"dtype": "int32", "name": "strided_slice_11/stack_2", "shape": [2]}, {"dtype": "int32", "name": "strided_slice_12/stack_1", "shape": [2]}, {"dtype": "int32", "name": "CropAndResize/CropAndResize/crop_size", "shape": [2]}, {"dtype": "int32", "name": "mul/y", "shape": []}, {"dtype": "int32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/concat/axis", "shape": []}, {"dtype": "int32", "name": "SecondStageBoxPredictor/AvgPool/reduction_indices", "shape": [2]}, {"dtype": "float32", "name": "SecondStageBoxPredictor/BoxEncodingPredictor/weights", "shape": [1024, 24]}, {"dtype": "float32", "name": "SecondStageBoxPredictor/BoxEncodingPredictor/biases", "shape": [24]}, {"dtype": "int32", "name": "SecondStageBoxPredictor/Reshape/shape", "shape": [4]}, {"dtype": "int32", "name": "SecondStagePostprocessor/Reshape/shape", "shape": [4]}, {"dtype": "int32", "name": "SecondStagePostprocessor/Tile/multiples", "shape": [4]}, {"dtype": "int32", "name": "SecondStagePostprocessor/stack/2", "shape": []}, {"dtype": "float32", "name": "SecondStageBoxPredictor/ClassPredictor/weights", "shape": [1024, 7]}, {"dtype": "float32", "name": "SecondStageBoxPredictor/ClassPredictor/biases", "shape": [7]}, {"dtype": "int32", "name": "SecondStageBoxPredictor/Reshape_1/shape", "shape": [3]}, {"dtype": "int32", "name": "SecondStagePostprocessor/Reshape_1/shape", "shape": [3]}, {"dtype": "int32", "name": "SecondStagePostprocessor/Slice/size", "shape": [3]}, {"dtype": "float32", "name": "ConstantFolding/Decode/truediv_recip", "shape": []}, {"dtype": "float32", "name": "ConstantFolding/Decode/truediv_2_recip", "shape": []}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_1a_7x7/separable_conv2d_weights", "shape": [1, 1, 24, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_1a_7x7/separable_conv2d_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2b_1x1/Conv2D_weights", "shape": [1, 1, 64, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2b_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2c_3x3/Conv2D_weights", "shape": [3, 3, 64, 192]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2c_3x3/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 192, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 192, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 192, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_3/Conv2d_0b_1x1/Conv2D_weights", "shape": [1, 1, 192, 32]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_3/Conv2d_0b_1x1/Conv2D_bn_offset", "shape": [32]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 64, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0c_3x3/Conv2D_weights", "shape": [3, 3, 96, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 256, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 256, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 256, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_3/Conv2d_0b_1x1/Conv2D_weights", "shape": [1, 1, 256, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_3/Conv2d_0b_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 64, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 64, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0c_3x3/Conv2D_weights", "shape": [3, 3, 96, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 320, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 320, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_0/Conv2d_1a_3x3/Conv2D_weights", "shape": [3, 3, 128, 160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_0/Conv2d_1a_3x3/Conv2D_bn_offset", "shape": [160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 64, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_1a_3x3/Conv2D_weights", "shape": [3, 3, 96, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_1a_3x3/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 224]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [224]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [64]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_3/Conv2d_0b_1x1/Conv2D_weights", "shape": [1, 1, 576, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_3/Conv2d_0b_1x1/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 64, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 96, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0c_3x3/Conv2D_weights", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 192]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_3/Conv2d_0b_1x1/Conv2D_weights", "shape": [1, 1, 576, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_3/Conv2d_0b_1x1/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 96, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 96, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0c_3x3/Conv2D_weights", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_3/Conv2d_0b_1x1/Conv2D_weights", "shape": [1, 1, 576, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_3/Conv2d_0b_1x1/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 128, 160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 128, 160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0c_3x3/Conv2D_weights", "shape": [3, 3, 160, 160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset", "shape": [160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [160]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_3/Conv2d_0b_1x1/Conv2D_weights", "shape": [1, 1, 576, 96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_3/Conv2d_0b_1x1/Conv2D_bn_offset", "shape": [96]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 128, 192]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 160, 192]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0c_3x3/Conv2D_weights", "shape": [3, 3, 192, 192]}, {"dtype": "float32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 128]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 576, 192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_0/Conv2d_1a_3x3/Conv2D_weights", "shape": [3, 3, 128, 192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_0/Conv2d_1a_3x3/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 192, 256]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [256]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_1a_3x3/Conv2D_weights", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_1a_3x3/Conv2D_bn_offset", "shape": [256]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 1024, 352]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [352]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 1024, 192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 1024, 160]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [160]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D_weights", "shape": [1, 1, 1024, 128]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 192, 320]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [320]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 160, 224]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [224]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D_weights", "shape": [3, 3, 224, 224]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset", "shape": [224]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_0/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 1024, 352]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [352]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_1/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 1024, 192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D_weights", "shape": [1, 1, 1024, 192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset", "shape": [192]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_3/Conv2d_0b_1x1/Conv2D_weights", "shape": [1, 1, 1024, 128]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_3/Conv2d_0b_1x1/Conv2D_bn_offset", "shape": [128]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_1/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 192, 320]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [320]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D_weights", "shape": [3, 3, 192, 224]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset", "shape": [224]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D_weights", "shape": [3, 3, 224, 224]}, {"dtype": "float32", "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset", "shape": [224]}, {"dtype": "int32", "name": "Preprocessor/map/while/add/y", "shape": []}, {"dtype": "int32", "name": "Preprocessor/map/while/ResizeToRange/strided_slice/stack", "shape": [1]}, {"dtype": "int32", "name": "Preprocessor/map/while/ResizeToRange/strided_slice/stack_1", "shape": [1]}, {"dtype": "int32", "name": "Preprocessor/map/while/ResizeToRange/strided_slice_1/stack_1", "shape": [1]}, {"dtype": "float32", "name": "Preprocessor/map/while/ResizeToRange/cond/resize_1/Cast", "shape": []}, {"dtype": "int32", "name": "Preprocessor/map/while/ResizeToRange/cond/resize_1/ExpandDims/dim", "shape": []}, {"dtype": "float32", "name": "Preprocessor/map/while/ResizeToRange/cond/resize_1/Cast_2", "shape": []}, {"dtype": "float32", "name": "Preprocessor/map/while/ResizeToRange/cond/resize/Cast", "shape": []}, {"dtype": "int32", "name": "Preprocessor/map/while/ResizeToRange/cond/resize/ExpandDims/dim", "shape": []}, {"dtype": "float32", "name": "Preprocessor/map/while/ResizeToRange/cond/resize/Cast_2", "shape": []}, {"dtype": "int32", "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/concat/axis", "shape": []}, {"dtype": "int32", "name": "ConstantFolding/BatchMultiClassNonMaxSuppression/ones/packed_const_axis", "shape": []}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/zeros_1/shape_as_tensor", "shape": [1]}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/zeros_1/Const", "shape": []}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/sub_2/x", "shape": []}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/range_1/delta", "shape": []}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/strided_slice/stack", "shape": [1]}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/strided_slice/stack_1", "shape": [1]}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/Select/e", "shape": []}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/sub_1/y", "shape": []}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Slice/begin", "shape": [2]}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/Reshape_1/shape", "shape": [2]}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Reshape/shape", "shape": [1]}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/Slice/begin", "shape": [3]}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/Reshape/shape", "shape": [3]}, {"dtype": "float32", "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/non_max_suppression_with_scores/iou_threshold", "shape": []}, {"dtype": "float32", "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/non_max_suppression_with_scores/score_threshold", "shape": []}, {"dtype": "float32", "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/mul/x", "shape": []}, {"dtype": "float32", "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/ones/Const", "shape": []}, {"dtype": "int32", "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/zeros_1", "shape": [2]}, {"dtype": "int32", "name": "map/while/add_1/y", "shape": []}, {"dtype": "float32", "name": "map/while/ToNormalizedCoordinates/truediv/x", "shape": []}, {"dtype": "int32", "name": "map/while/strided_slice/stack", "shape": [1]}, {"dtype": "int32", "name": "map/while/strided_slice/stack_1", "shape": [1]}, {"dtype": "int32", "name": "map/while/strided_slice_1/stack_1", "shape": [1]}, {"dtype": "int32", "name": "map_2/while/add_1/y", "shape": []}, {"dtype": "int32", "name": "ConstantFolding/SecondStagePostprocessor/BatchGather/concat/values_0_const_axis", "shape": []}, {"dtype": "float32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/GreaterEqual/y", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Const_1", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Slice_1/begin", "shape": [2]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/stack_1/1", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Reshape_1/shape", "shape": [1]}, {"dtype": "float32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/non_max_suppression_with_scores_1/iou_threshold", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Minimum_1/x", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/strided_slice_3/stack_1", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/range_1/start", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/concat_3/axis", "shape": []}, {"dtype": "float32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/mul_1/x", "shape": []}, {"dtype": "float32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/ones_1/Const", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/sub_9/x", "shape": []}, {"dtype": "float32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/add_5/y", "shape": []}, {"dtype": "float32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/add_7/y", "shape": []}, {"dtype": "float32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/add_9/y", "shape": []}, {"dtype": "float32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/add_11/y", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/zeros_9/shape_as_tensor", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/Slice_4/begin", "shape": [2]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/Reshape_4/shape", "shape": [2]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/Slice/begin", "shape": [3]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/Reshape/shape", "shape": [3]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Slice_3/begin", "shape": [2]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Slice_5/begin", "shape": [2]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/sub_11/y", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Slice_2/begin", "shape": [2]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Slice_4/begin", "shape": [2]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/ChangeCoordinateFrame/strided_slice/stack_1", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/ChangeCoordinateFrame/strided_slice_2/stack_1", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/sub_1/y", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/Reshape_1/shape", "shape": [2]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/zeros_7", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/zeros_9", "shape": [2]}, {"dtype": "float32", "name": "ConstantFolding/SecondStagePostprocessor/map/while/ClipToWindow/unstack-folded-0", "shape": []}, {"dtype": "float32", "name": "ConstantFolding/SecondStagePostprocessor/map/while/ClipToWindow/unstack-folded-2", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/map/while/add/y", "shape": []}, {"dtype": "int32", "name": "SecondStagePostprocessor/map/while/strided_slice/stack", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/map/while/strided_slice/stack_1", "shape": [1]}, {"dtype": "int32", "name": "SecondStagePostprocessor/map/while/strided_slice_1/stack_1", "shape": [1]}, {"dtype": "int32", "name": "ConstantFolding/SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/Slice_3/size_const_axis", "shape": []}, {"dtype": "int32", "name": "ConstantFolding/SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/Slice_2/size_const_axis", "shape": []}, {"dtype": "int32", "name": "ConstantFolding/SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/stack_3/values_1_const_axis", "shape": []}, {"dtype": "int32", "name": "ConstantFolding/SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/stack_2/values_1_const_axis", "shape": []}]}], "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": {"versions": {"producer": 134}, "node": [{"op": "Placeholder", "attr": {"dtype": {"type": "DT_UINT8"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "name": "image_tensor"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "map_2/Const"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "SecondStagePostprocessor/map/TensorArrayUnstack_1/strided_slice/stack"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "SecondStagePostprocessor/map/TensorArrayUnstack_1/strided_slice/stack_1"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "SecondStagePostprocessor/map/TensorArrayUnstack_1/range/delta"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "strided_slice_15/stack_1"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "strided_slice_14/stack_1"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "SecondStagePostprocessor/strided_slice_4/stack"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "SecondStagePostprocessor/strided_slice_4/stack_1"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "SecondStagePostprocessor/strided_slice_4/stack_2"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "SecondStagePostprocessor/ArgMax/dimension"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "SecondStagePostprocessor/ExpandDims_2/dim"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "SecondStagePostprocessor/BatchGather/Reshape_2/shape"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "Preprocessor/mul/x"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "Preprocessor/sub/y"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "8"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/Conv2d_1a_7x7/depthwise_weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "512"}]}}}}, "name": "Conv/weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "name": "Conv/biases"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "24"}]}}}}, "name": "FirstStageBoxPredictor/ClassPredictor/weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "name": "FirstStageBoxPredictor/ClassPredictor/biases"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "strided_slice_10/stack_1"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "48"}]}}}}, "name": "FirstStageBoxPredictor/BoxEncodingPredictor/weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}, "name": "FirstStageBoxPredictor/BoxEncodingPredictor/biases"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "FirstStageBoxPredictor/Reshape/shape/3"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "Reshape_1/shape"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "Decode/transpose/perm"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "GridAnchorGenerator/strided_slice_2"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "GridAnchorGenerator/strided_slice_3"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "GridAnchorGenerator/Meshgrid_3/ExpandedShape/concat"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "GridAnchorGenerator/Reshape_2/shape"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "GridAnchorGenerator/mul_5/x"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}]}}}}, "name": "GridAnchorGenerator/Meshgrid_3/Reshape"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}]}}}}, "name": "GridAnchorGenerator/Meshgrid_2/Reshape"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "strided_slice_11/stack"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "strided_slice_11/stack_1"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "strided_slice_11/stack_2"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "strided_slice_12/stack_1"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "CropAndResize/CropAndResize/crop_size"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "mul/y"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/concat/axis"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "SecondStageBoxPredictor/AvgPool/reduction_indices"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "24"}]}}}}, "name": "SecondStageBoxPredictor/BoxEncodingPredictor/weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "name": "SecondStageBoxPredictor/BoxEncodingPredictor/biases"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "SecondStageBoxPredictor/Reshape/shape"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "SecondStagePostprocessor/Reshape/shape"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "SecondStagePostprocessor/Tile/multiples"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "SecondStagePostprocessor/stack/2"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "7"}]}}}}, "name": "SecondStageBoxPredictor/ClassPredictor/weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}}, "name": "SecondStageBoxPredictor/ClassPredictor/biases"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "SecondStageBoxPredictor/Reshape_1/shape"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "SecondStagePostprocessor/Reshape_1/shape"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "SecondStagePostprocessor/Slice/size"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "ConstantFolding/Decode/truediv_recip"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "ConstantFolding/Decode/truediv_2_recip"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_1a_7x7/separable_conv2d_weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_1a_7x7/separable_conv2d_bn_offset"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2b_1x1/Conv2D_weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2b_1x1/Conv2D_bn_offset"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "192"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2c_3x3/Conv2D_weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2c_3x3/Conv2D_bn_offset"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_0/Conv2d_0a_1x1/Conv2D_weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_0/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0a_1x1/Conv2D_weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0a_1x1/Conv2D_weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_3/Conv2d_0b_1x1/Conv2D_weights"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": 